Jack-Herron/STM32_Skipper_Development/USB Device And Host Development/USB_HID_Host/Src/USB_HID_Host.c
	USB_HID_Host___Delete_HID_Node(port_Number, HID_Node);

	printf("Interface Disconnected at interface %d\n", interface_Number);
}

void USB_HID_Host___URB_Setup_Callback(USB_Host_Transfers___URB_CALLBACK_PARAMETERS);

void USB_HID_Host___Get_HID_Report_Descriptor(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number, uint16_t length, uint8_t* p_Buffer, void callback(USB_Host_Transfers___URB_CALLBACK_PARAMETERS))
{
	USB_Host_Transfers___Control_Setup_Packet_TypeDef setup_Packet;
	setup_Packet.bmRequestType 	= USB_Host_Transfers___CONTROL_SETUP_PACKET_BMREQUESTTYPE_STANDARD_INTERFACE_TO_HOST;
	setup_Packet.bRequest 		= USB_Host_Transfers___CONTROL_SETUP_PACKET_BREQUEST_GET_DESCRIPTOR;
	setup_Packet.wValue 		= 0x2200;
	setup_Packet.wIndex 		= interface_Number;
	setup_Packet.wLength 		= length;

	USB_Host_Transfers___Control_Transfer(port_Number, device_Address, USB_Host___ENDPOINT_ZERO, USB_Host___TRANSFER_DIRECTION_IN, setup_Packet, p_Buffer, length, USB_HID_Host___STANDARD_NUMBER_OF_RETRIES, callback);
}

void USB_HID_Host___Get_HID_Descriptor(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number, uint16_t length, uint8_t* p_Buffer, void callback(USB_Host_Transfers___URB_CALLBACK_PARAMETERS))
{
	USB_Host_Transfers___Control_Setup_Packet_TypeDef setup_Packet;
	setup_Packet.bmRequestType 	= USB_Host_Transfers___CONTROL_SETUP_PACKET_BMREQUESTTYPE_STANDARD_INTERFACE_TO_HOST;
	setup_Packet.bRequest 		= USB_Host_Transfers___CONTROL_SETUP_PACKET_BREQUEST_GET_DESCRIPTOR;
	setup_Packet.wValue 		= 0x2100;
	setup_Packet.wIndex 		= interface_Number;
	setup_Packet.wLength 		= length;

	USB_Host_Transfers___Control_Transfer(port_Number, device_Address, USB_Host___ENDPOINT_ZERO, USB_Host___TRANSFER_DIRECTION_IN, setup_Packet, p_Buffer, length, USB_HID_Host___STANDARD_NUMBER_OF_RETRIES, callback);
}

void USB_HID_Host___Set_Protocol_Transfer(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number, uint8_t protocol, void callback(USB_Host_Transfers___URB_CALLBACK_PARAMETERS))
{
	USB_Host_Transfers___Control_Setup_Packet_TypeDef setup_Packet;
	setup_Packet.bmRequestType 	= USB_Host_Transfers___CONTROL_SETUP_PACKET_BMREQUESTTYPE_CLASS_HOST_TO_INTERFACE;
	setup_Packet.bRequest 		= USB_HID_Host___bRequest_SET_PROTOCOL;
	setup_Packet.wValue 		= protocol;
	setup_Packet.wIndex 		= interface_Number;
	setup_Packet.wLength 		= 0;

	USB_Host_Transfers___Control_Transfer(port_Number, device_Address, USB_Host___ENDPOINT_ZERO, USB_Host___TRANSFER_DIRECTION_OUT, setup_Packet, 0, 0, USB_HID_Host___STANDARD_NUMBER_OF_RETRIES, callback);
}

void USB_HID_Host___Calculate_Report_Size(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number)
{
	USB_HID_Host___HID_Interface_Node_TypeDef* p_HID_Node = USB_HID_Host___Get_HID_Node_From_Device_Interface(port_Number, device_Address, interface_Number);
	USB_HID_Host___HID_Interface_TypeDef* p_HID_Interface = &p_HID_Node->HID_Device;

	if(p_HID_Interface->current_Protocol == USB_HID_Host___PROTOCOL_BOOT_MODE)
	{
		if (p_HID_Interface->device_Type == USB_HID_Host___DEVICE_TYPE_KEYBOARD)
		{
			p_HID_Interface->HID_IN_Report_Size = USB_HID_Host___REPORT_SIZE_BOOT_KEYBOARD;
		}
		else if (p_HID_Interface->device_Type == USB_HID_Host___DEVICE_TYPE_MOUSE)
		{
			p_HID_Interface->HID_IN_Report_Size = USB_HID_Host___REPORT_SIZE_BOOT_MOUSE;
		}
	}
	else
	{
		// calculate from report descriptor
	}
}

void USB_HID_Host___URB_Set_Protocol_Callback(USB_Host_Transfers___URB_CALLBACK_PARAMETERS)
{
	if(URB.transfer_Status == USB_Host_Transfers___URB_STATUS_SUCCESS)
	{
		USB_HID_Host___HID_Interface_Node_TypeDef* p_HID_Node = USB_HID_Host___Get_HID_Node_From_Device_Interface(URB.port_Number, URB.device_Address, URB.control_Setup_Packet.wIndex);
		if(p_HID_Node != NULL)
		{
			p_HID_Node->HID_Device.current_Protocol = URB.control_Setup_Packet.wValue;

			USB_HID_Host___Calculate_Report_Size(URB.port_Number, URB.device_Address, URB.control_Setup_Packet.wIndex);

			if(p_HID_Node->HID_Device.set_Protocol_Callback != NULL)
			{
				p_HID_Node->HID_Device.set_Protocol_Callback(URB.port_Number, URB.device_Address, URB.control_Setup_Packet.wIndex);
			}
		}
	}
	else
	{
		// delete node, end device
	}
}

void USB_HID_Host___Set_Protocol(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number, uint8_t protocol, void callback(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number))
{
	USB_HID_Host___HID_Interface_Node_TypeDef* p_HID_Node = USB_HID_Host___Get_HID_Node_From_Device_Interface(port_Number, device_Address, interface_Number);
	p_HID_Node->HID_Device.set_Protocol_Callback = callback;
	USB_HID_Host___Set_Protocol_Transfer(port_Number, device_Address, interface_Number, protocol, USB_HID_Host___URB_Set_Protocol_Callback);
}

uint32_t test_Num = 0;

void USB_HID_Host___Interrupt_URB_Callback(USB_Host_Transfers___URB_CALLBACK_PARAMETERS)
{
	USB_HID_Host___HID_Interface_Node_TypeDef* p_HID_Node = USB_HID_Host___Get_HID_Node_From_IN_Endpoint(URB.port_Number, URB.device_Address, URB.endpoint_Number);

	if(p_HID_Node != NULL)
	{
		if(URB.transfer_Status == USB_Host_Transfers___URB_STATUS_SUCCESS)
		{
			printf("\n");
			printf("Received report: ");
			for(uint32_t i = 0; i < URB.transfer_Length; i++)
			{
				printf("%d ", (int8_t)URB.transfer_Buffer[i]);
			}
			printf("\n");
			printf("%ld \n", test_Num++);

		}
	}
}

void USB_HID_Host___Polling_Callback(uint8_t port_Number, void* context)
{
	USB_HID_Host___HID_Interface_Node_TypeDef *p_HID_Node = (USB_HID_Host___HID_Interface_Node_TypeDef*)context;
	uint8_t odd_Frame = USB_Host___Get_Frame_Number(port_Number) %2;
	USB_Host_Transfers___Interrupt_Transfer(port_Number, p_HID_Node->HID_Device.device_Address, p_HID_Node->HID_Device.interrupt_In_Endpoint_Number, USB_Host_Transfers___URB_DIRECTION_IN, p_HID_Node->HID_Device.HID_Report_Buffer, p_HID_Node->HID_Device.HID_IN_Report_Size, 0, odd_Frame, 1, USB_HID_Host___Interrupt_URB_Callback);
}

void USB_HID_Host___Start_Reporting(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number)
{
	USB_HID_Host___HID_Interface_Node_TypeDef *p_HID_Node = USB_HID_Host___Get_HID_Node_From_Device_Interface(port_Number, device_Address, interface_Number);

	uint8_t polling_Interval = p_HID_Node->HID_Device.interrupt_In_Endpoint_Interval;

	USB_Host_Device_Manager___Add_Interface_Polling_Process(p_HID_Node->HID_Device.port_Number, p_HID_Node->HID_Device.device_Address, USB_Host_Device_Manager___Get_Device_Current_Configuration_Number(p_HID_Node->HID_Device.port_Number, p_HID_Node->HID_Device.device_Address), p_HID_Node->HID_Device.interface_Number, polling_Interval, (void*)p_HID_Node, USB_HID_Host___Polling_Callback);
}

void USB_HID_Host___Do_Setup_Stage(USB_HID_Host___HID_Interface_Node_TypeDef* p_HID_Node)
{
	uint8_t port_Number 		= p_HID_Node->HID_Device.port_Number;
	uint8_t device_Address	 	= p_HID_Node->HID_Device.device_Address;
	uint8_t interface_Number 	= p_HID_Node->HID_Device.interface_Number;

