Jack-Herron/STM32_Skipper_Development/USB Device And Host Development/USB_HID_Host/Src/USB_HID_Host.c
	printf("interface %d is a HID interface\n", interface_Number);
}

void USB_HID_Host___Setup_HID_Device(uint8_t port_Number, uint8_t device_Address)
{
	uint8_t 										current_Configuration_Number	= USB_Host_Device_Manager___Get_Device_Current_Configuration_Number(port_Number, device_Address);
	if(current_Configuration_Number > 0)
	{
		USB_Host___Device_Descriptor_TypeDef			device_Descriptor				= USB_Host_Device_Manager___Device_Get_Device_Descriptor(port_Number, device_Address);
		USB_Host___Configuration_Descriptor_TypeDef 	configuration_Descriptor 		= USB_Host_Device_Manager___Device_Get_Configuration_Descriptor(port_Number, device_Address, current_Configuration_Number);

		if(device_Descriptor.bDeviceClass == USB_HID_Host___COMPOSITE_DEVICE_CLASS)
		{
			for(uint8_t i = 0; i < configuration_Descriptor.bNumInterfaces; i++)
			{
				USB_Host___Interface_Descriptor_TypeDef 	interface_Descriptor 		= USB_Host_Device_Manager___Device_Get_Interface_Descriptor(port_Number, device_Address, current_Configuration_Number, i);

				if(interface_Descriptor.bInterfaceClass == USB_HID_Host___HID_INTERFACE_CLASS)
				{
					USB_HID_Host___Setup_HID_Interface(port_Number, device_Address, current_Configuration_Number, i, interface_Descriptor.bInterfaceSubClass, interface_Descriptor.bInterfaceProtocol);
				}
			}
		}
	}
}

uint8_t USB_HID_Host___Register_Interface(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number)
{
	USB_HID_Host___HID_Interface_Node_TypeDef* HID_Node = USB_HID_Host___Get_HID_Node_From_Device_Interface(port_Number, device_Address, interface_Number);
	if (HID_Node != NULL)
	{
		if (HID_Node->HID_Device.HID_Descriptor.interface_Registered == false)
		{
			HID_Node->HID_Device.HID_Descriptor.interface_Registered = true;
			return (EXIT_SUCCESS);
		}
		return (EXIT_SUCCESS);
	}
	return (EXIT_FAILURE);
}

void USB_HID_Host___Set_Interface_Report_Callback(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number, void callback())
{
	// set callback
}

void USB_HID_Host___Device_Connected_Callback(uint8_t port_Number, uint8_t device_Address)
{
	if(USB_HID_Host___Is_Device_HID_Device(port_Number, device_Address))
	{
		printf("HID Device Connected!\n");
		USB_HID_Host___Setup_HID_Device(port_Number, device_Address);
	}
}

uint8_t USB_HID_Host___Add_Interface_Connected_Callback(uint8_t port_Number, void (*callback)(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number))
{
	uint8_t first_Free_Index = 0;
	uint8_t free_Index_Found = false;

	for (uint8_t i = 0; i < USB_HID_Host___MAX_APPLICATIONS; i++)
	{
		if (USB_HID_Host___Application_Callbacks[port_Number].HID_Interface_Connected_Callback[i] == NULL && !free_Index_Found)
		{
			free_Index_Found = true;
            first_Free_Index = i;
		}
		else if (USB_HID_Host___Application_Callbacks[port_Number].HID_Interface_Connected_Callback[i] == callback)
		{
			return (EXIT_SUCCESS);
		}
	}
	if (free_Index_Found)
	{
		USB_HID_Host___Application_Callbacks[port_Number].HID_Interface_Connected_Callback[first_Free_Index] = callback;
		return (EXIT_SUCCESS);
	}
	return (EXIT_FAILURE);
}

uint8_t USB_HID_Host___Add_Interface_Disconnected_Callback(uint8_t port_Number, void (*callback)(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number))
{
	uint8_t first_Free_Index = 0;
	uint8_t free_Index_Found = false;

	for (uint8_t i = 0; i < USB_HID_Host___MAX_APPLICATIONS; i++)
	{
		if (USB_HID_Host___Application_Callbacks[port_Number].HID_Interface_Disconnected_Callback[i] == NULL && !free_Index_Found)
		{
			free_Index_Found = true;
            first_Free_Index = i;
		}
		else if (USB_HID_Host___Application_Callbacks[port_Number].HID_Interface_Disconnected_Callback[i] == callback)
		{
			return (EXIT_SUCCESS);
		}
	}
	if (free_Index_Found)
	{
		USB_HID_Host___Application_Callbacks[port_Number].HID_Interface_Disconnected_Callback[first_Free_Index] = callback;
		return (EXIT_SUCCESS);
	}
	return (EXIT_FAILURE);
}

void USB_HID_Host___Set_Report_Callback(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number, void (*callback)(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number, uint8_t *report_Buffer, uint16_t report_Length))
{
	USB_HID_Host___HID_Interface_Node_TypeDef *HID_Node = USB_HID_Host___Get_HID_Node_From_Device_Interface(port_Number, device_Address, interface_Number);
	if (HID_Node != NULL)
	{
		HID_Node->HID_Device.report_Callback = callback;
	}
}

void USB_HID_Host___Remove_Interface_Disconnected_Callback(uint8_t port_Number, void (*callback)(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number))
{
	for (uint8_t i = 0; i < USB_HID_Host___MAX_APPLICATIONS; i++)
	{
		if (USB_HID_Host___Application_Callbacks[port_Number].HID_Interface_Disconnected_Callback[i] == callback)
		{
			USB_HID_Host___Application_Callbacks[port_Number].HID_Interface_Disconnected_Callback[i] = NULL;
		}
	}
}

uint8_t USB_HID_Host___Interface_Is_Boot_Mode_Supported(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number)
{
	USB_HID_Host___HID_Interface_Node_TypeDef *HID_Node = USB_HID_Host___Get_HID_Node_From_Device_Interface(port_Number, device_Address, interface_Number);
	if (HID_Node != NULL)
	{
		return (HID_Node->HID_Device.boot_Mode_Supported);
	}
	return (EXIT_FAILURE);
}

uint8_t USB_HID_Host___Interface_Get_Device_Type(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number)
{
	USB_HID_Host___HID_Interface_Node_TypeDef *HID_Node = USB_HID_Host___Get_HID_Node_From_Device_Interface(port_Number, device_Address, interface_Number);
	if (HID_Node != NULL)
	{
		return(HID_Node->HID_Device.device_Type);
	}
    return (0);
}

void USB_HID_Host___Remove_Interface_Connected_Callback(uint8_t port_Number, void (*callback)(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number))
{
	for (uint8_t i = 0; i < USB_HID_Host___MAX_APPLICATIONS; i++)
	{
		if (USB_HID_Host___Application_Callbacks[port_Number].HID_Interface_Connected_Callback[i] == callback)
		{
			USB_HID_Host___Application_Callbacks[port_Number].HID_Interface_Connected_Callback[i] = NULL;
		}
	}
}

void USB_HID_Host___Init(uint8_t port_Number)
{
	USB_Host___Add_Device_Connected_Callback(port_Number, USB_HID_Host___Device_Connected_Callback);
}
